; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v9 ?v10)
             (pred_7 ?v12 ?v11)
             (pred_9 ?v9 ?v11)
             (pred_12 ?v4 ?v9 )
	     (pred_5 ?v9)
             (pred_11 ?v2)
             (pred_1 ?v12)
             (pred_2 ?v11)
             (pred_8 ?v9)
             (pred_3 ?v12)
             (pred_10 ?v9)
             (pred_4 ))



(:action op_1
:parameters (?v3 ?v1 ?v7 ?v6)
:precondition (and (pred_11 ?v3) (pred_11 ?v1) (pred_1 ?v7) (pred_2 ?v6)
          (pred_6 ?v3 ?v1) (pred_7 ?v7 ?v6)
                   (pred_9 ?v1 ?v6) (pred_5 ?v3) 
                   (pred_8 ?v1) (pred_3 ?v7))
:effect (and  (pred_10 ?v1) (not (pred_8 ?v1))))


(:action op_5
:parameters (?v3 ?v5)
:precondition (and (pred_11 ?v3) (pred_11 ?v5)
               (pred_5 ?v3) (pred_6 ?v3 ?v5) (pred_10 ?v5))
:effect (and (pred_5 ?v5) (not (pred_5 ?v3))))

(:action op_3
:parameters (?v3 ?v7)
:precondition (and (pred_11 ?v3) (pred_1 ?v7) 
                  (pred_5 ?v3) (pred_12 ?v7 ?v3) (pred_4 ))
:effect (and (pred_3 ?v7)
   (not (pred_12 ?v7 ?v3)) (not (pred_4 ))))


(:action op_2
:parameters (?v3 ?v8 ?v13)
:precondition (and (pred_11 ?v3) (pred_1 ?v8) (pred_1 ?v13)
                  (pred_5 ?v3) (pred_3 ?v13) (pred_12 ?v8 ?v3))
:effect (and (pred_3 ?v8) (pred_12 ?v13 ?v3)
        (not (pred_3 ?v13)) (not (pred_12 ?v8 ?v3))))

(:action op_4
:parameters (?v3 ?v7)
:precondition (and (pred_11 ?v3) (pred_1 ?v7) 
                  (pred_5 ?v3) (pred_3 ?v7))
:effect (and (pred_4 ) (pred_12 ?v7 ?v3) (not (pred_3 ?v7)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_21 obj_18 obj_08 obj_02 obj_11 obj_01 obj_10 obj_09 obj_03 obj_06 obj_07 obj_04 obj_17 obj_22 obj_20 obj_12
    obj_16 obj_13 obj_05
    obj_15 obj_19 obj_14
    )

    (:init
       (pred_4)

       (pred_11 obj_21)
       (pred_11 obj_18)
       (pred_11 obj_08)
       (pred_11 obj_02)
       (pred_11 obj_11)
       (pred_11 obj_01)
       (pred_11 obj_10)
       (pred_11 obj_09)
       (pred_11 obj_03)
       (pred_11 obj_06)
       (pred_11 obj_07)
       (pred_11 obj_04)
       (pred_11 obj_17)
       (pred_11 obj_22)
       (pred_11 obj_20)
       (pred_11 obj_12)
       (pred_2 obj_16)
       (pred_2 obj_13)
       (pred_2 obj_05)
       (pred_1 obj_15)
       (pred_1 obj_19)
       (pred_1 obj_14)

       (pred_6 obj_21 obj_11)
       (pred_6 obj_21 obj_18)
       (pred_6 obj_18 obj_01)
       (pred_6 obj_18 obj_08)
       (pred_6 obj_18 obj_21)
       (pred_6 obj_08 obj_10)
       (pred_6 obj_08 obj_02)
       (pred_6 obj_08 obj_18)
       (pred_6 obj_02 obj_09)
       (pred_6 obj_02 obj_08)
       (pred_6 obj_11 obj_03)
       (pred_6 obj_11 obj_01)
       (pred_6 obj_11 obj_21)
       (pred_6 obj_01 obj_06)
       (pred_6 obj_01 obj_10)
       (pred_6 obj_01 obj_18)
       (pred_6 obj_01 obj_11)
       (pred_6 obj_10 obj_07)
       (pred_6 obj_10 obj_09)
       (pred_6 obj_10 obj_08)
       (pred_6 obj_10 obj_01)
       (pred_6 obj_09 obj_04)
       (pred_6 obj_09 obj_02)
       (pred_6 obj_09 obj_10)
       (pred_6 obj_03 obj_17)
       (pred_6 obj_03 obj_06)
       (pred_6 obj_03 obj_11)
       (pred_6 obj_06 obj_22)
       (pred_6 obj_06 obj_07)
       (pred_6 obj_06 obj_01)
       (pred_6 obj_06 obj_03)
       (pred_6 obj_07 obj_20)
       (pred_6 obj_07 obj_04)
       (pred_6 obj_07 obj_10)
       (pred_6 obj_07 obj_06)
       (pred_6 obj_04 obj_12)
       (pred_6 obj_04 obj_09)
       (pred_6 obj_04 obj_07)
       (pred_6 obj_17 obj_22)
       (pred_6 obj_17 obj_03)
       (pred_6 obj_22 obj_20)
       (pred_6 obj_22 obj_06)
       (pred_6 obj_22 obj_17)
       (pred_6 obj_20 obj_12)
       (pred_6 obj_20 obj_07)
       (pred_6 obj_20 obj_22)
       (pred_6 obj_12 obj_04)
       (pred_6 obj_12 obj_20)
       (pred_8 obj_04)
       (pred_8 obj_02)
       (pred_8 obj_06)
       (pred_9  obj_04 obj_16)
       (pred_9  obj_02 obj_13)
       (pred_9  obj_06 obj_05)
       (pred_10 obj_21)
       (pred_10 obj_18)
       (pred_10 obj_08)
       (pred_10 obj_11)
       (pred_10 obj_01)
       (pred_10 obj_10)
       (pred_10 obj_09)
       (pred_10 obj_03)
       (pred_10 obj_07)
       (pred_10 obj_17)
       (pred_10 obj_22)
       (pred_10 obj_20)
       (pred_10 obj_12)

       (pred_7  obj_15 obj_16)
       (pred_7  obj_19 obj_13)
       (pred_7  obj_14 obj_05)
       (pred_12 obj_15 obj_22)
       (pred_12 obj_19 obj_12)
       (pred_12 obj_14 obj_17)
       (pred_5 obj_10)
    )

    (:goal (and
       (pred_12 obj_15 obj_03)
       (pred_12 obj_19 obj_09)
       (pred_12 obj_14 obj_06)
    ))
(:constraints
  (always (not (pred_5 obj_07)))
)
)

; plan
1. (op_5 obj_10 obj_01)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_01)
   goals met: 0 of 3
2. (op_5 obj_01 obj_11)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_11)
   goals met: 0 of 3
3. (op_5 obj_11 obj_03)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_03)
   goals met: 0 of 3
4. (op_5 obj_03 obj_17)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_17)
   goals met: 0 of 3
5. (op_5 obj_17 obj_22)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_22)
   goals met: 0 of 3
6. (op_3 obj_22 obj_15)
   deleted: (pred_12 obj_15 obj_22) (pred_4)
   added: (pred_3 obj_15)
   goals met: 0 of 3
7. (op_5 obj_22 obj_17)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_17)
   goals met: 0 of 3
8. (op_2 obj_17 obj_14 obj_15)
   deleted: (pred_3 obj_15) (pred_12 obj_14 obj_17)
   added: (pred_3 obj_14) (pred_12 obj_15 obj_17)
   goals met: 0 of 3
9. (op_5 obj_17 obj_22)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_22)
   goals met: 0 of 3
10. (op_1 obj_22 obj_06 obj_14 obj_05)
   deleted: (pred_8 obj_06)
   added: (pred_10 obj_06)
   goals met: 0 of 3
11. (op_4 obj_22 obj_14)
   deleted: (pred_3 obj_14)
   added: (pred_4) (pred_12 obj_14 obj_22)
   goals met: 0 of 3
12. (op_5 obj_22 obj_20)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_20)
   goals met: 0 of 3
13. (op_5 obj_20 obj_12)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_12)
   goals met: 0 of 3
14. (op_3 obj_12 obj_19)
   deleted: (pred_12 obj_19 obj_12) (pred_4)
   added: (pred_3 obj_19)
   goals met: 0 of 3
15. (op_5 obj_12 obj_20)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_20)
   goals met: 0 of 3
16. (op_5 obj_20 obj_22)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_22)
   goals met: 0 of 3
17. (op_2 obj_22 obj_14 obj_19)
   deleted: (pred_3 obj_19) (pred_12 obj_14 obj_22)
   added: (pred_3 obj_14) (pred_12 obj_19 obj_22)
   goals met: 0 of 3
18. (op_5 obj_22 obj_06)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_06)
   goals met: 0 of 3
19. (op_4 obj_06 obj_14)
   deleted: (pred_3 obj_14)
   added: (pred_4) (pred_12 obj_14 obj_06)
   goals met: 1 of 3
20. (op_5 obj_06 obj_22)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_22)
   goals met: 1 of 3
21. (op_3 obj_22 obj_19)
   deleted: (pred_12 obj_19 obj_22) (pred_4)
   added: (pred_3 obj_19)
   goals met: 1 of 3
22. (op_5 obj_22 obj_17)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_17)
   goals met: 1 of 3
23. (op_2 obj_17 obj_15 obj_19)
   deleted: (pred_3 obj_19) (pred_12 obj_15 obj_17)
   added: (pred_3 obj_15) (pred_12 obj_19 obj_17)
   goals met: 1 of 3
24. (op_5 obj_17 obj_03)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_03)
   goals met: 1 of 3
25. (op_4 obj_03 obj_15)
   deleted: (pred_3 obj_15)
   added: (pred_4) (pred_12 obj_15 obj_03)
   goals met: 2 of 3
26. (op_5 obj_03 obj_17)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_17)
   goals met: 2 of 3
27. (op_3 obj_17 obj_19)
   deleted: (pred_12 obj_19 obj_17) (pred_4)
   added: (pred_3 obj_19)
   goals met: 2 of 3
28. (op_5 obj_17 obj_03)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_03)
   goals met: 2 of 3
29. (op_5 obj_03 obj_11)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_11)
   goals met: 2 of 3
30. (op_5 obj_11 obj_01)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_01)
   goals met: 2 of 3
31. (op_5 obj_01 obj_10)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_10)
   goals met: 2 of 3
32. (op_5 obj_10 obj_09)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_09)
   goals met: 2 of 3
33. (op_4 obj_09 obj_19)
   deleted: (pred_3 obj_19)
   added: (pred_4) (pred_12 obj_19 obj_09)
   goals met: 3 of 3
